t/SIG41.out

<e:Envelope xmlns:e="http://schemas.xmlsoap.org/soap/envelope/"><e:Header><a:To xmlns:a="http://www.w3.org/2005/08/addressing" xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd" wsu:Id="TO" e:actor="http://schemas.xmlsoap.org/soap/actor/next" e:mustUnderstand="1">http://62.58.7.83:56001/Persoon_dbo_v0.1</a:To><a:ReplyTo xmlns:a="http://www.w3.org/2005/08/addressing" xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd" wsu:Id="REP" e:actor="http://schemas.xmlsoap.org/soap/actor/next" e:mustUnderstand="1"><a:Address>http://www.w3.org/2005/03/addressing/role/anonymous</a:Address></a:ReplyTo><a:MessageID xmlns:a="http://www.w3.org/2005/08/addressing" xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd" wsu:Id="MID" e:actor="http://schemas.xmlsoap.org/soap/actor/next" e:mustUnderstand="1">urn:MS7yGQvpmHH3bmt5x4zSPWPuC</a:MessageID><b:Sender xmlns:b="urn:liberty:sb:2006-08" xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd" providerID="http://tripod.kenteq.nl/SSO/ZXID.ashx" wsu:Id="PRV" e:actor="http://schemas.xmlsoap.org/soap/actor/next" e:mustUnderstand="1"/><sbf:Framework xmlns:sbf="urn:liberty:sb" xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd" version="2.0" wsu:Id="FWK" e:actor="http://schemas.xmlsoap.org/soap/actor/next" e:mustUnderstand="1"/><sbf:Framework xmlns:sbf="urn:liberty:sb" xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd" version="2.0" wsu:Id="FWK" e:actor="http://schemas.xmlsoap.org/soap/actor/next" e:mustUnderstand="1"/><wsse:Security xmlns:wsse="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd" e:actor="http://schemas.xmlsoap.org/soap/actor/next" e:mustUnderstand="1"><ds:Signature xmlns:ds="http://www.w3.org/2000/09/xmldsig#"><ds:SignedInfo><ds:CanonicalizationMethod Algorithm="http://www.w3.org/2001/10/xml-exc-c14n#"/><ds:SignatureMethod Algorithm="http://www.w3.org/2000/09/xmldsig#rsa-sha1"/><ds:Reference URI="#FWK"><ds:Transforms><ds:Transform Algorithm="http://www.w3.org/2000/09/xmldsig#enveloped-signature"/><ds:Transform Algorithm="http://www.w3.org/2001/10/xml-exc-c14n#"/></ds:Transforms><ds:DigestMethod Algorithm="http://www.w3.org/2000/09/xmldsig#sha1"/><ds:DigestValue>fbdS0qHp2AqBJtZAd+Gd08P5sDI=</ds:DigestValue></ds:Reference><ds:Reference URI="#TS"><ds:Transforms><ds:Transform Algorithm="http://www.w3.org/2000/09/xmldsig#enveloped-signature"/><ds:Transform Algorithm="http://www.w3.org/2001/10/xml-exc-c14n#"/></ds:Transforms><ds:DigestMethod Algorithm="http://www.w3.org/2000/09/xmldsig#sha1"/><ds:DigestValue>nf8IyX5bv8bw8omwkeuNfietYio=</ds:DigestValue></ds:Reference><ds:Reference URI="#MID"><ds:Transforms><ds:Transform Algorithm="http://www.w3.org/2000/09/xmldsig#enveloped-signature"/><ds:Transform Algorithm="http://www.w3.org/2001/10/xml-exc-c14n#"/></ds:Transforms><ds:DigestMethod Algorithm="http://www.w3.org/2000/09/xmldsig#sha1"/><ds:DigestValue>STxgUva4Ibvja/OGnp1XSel1gWQ=</ds:DigestValue></ds:Reference><ds:Reference URI="#TO"><ds:Transforms><ds:Transform Algorithm="http://www.w3.org/2000/09/xmldsig#enveloped-signature"/><ds:Transform Algorithm="http://www.w3.org/2001/10/xml-exc-c14n#"/></ds:Transforms><ds:DigestMethod Algorithm="http://www.w3.org/2000/09/xmldsig#sha1"/><ds:DigestValue>N12qUQKdAtRdsqOPKif7mNUJ1To=</ds:DigestValue></ds:Reference><ds:Reference URI="#REP"><ds:Transforms><ds:Transform Algorithm="http://www.w3.org/2000/09/xmldsig#enveloped-signature"/><ds:Transform Algorithm="http://www.w3.org/2001/10/xml-exc-c14n#"/></ds:Transforms><ds:DigestMethod Algorithm="http://www.w3.org/2000/09/xmldsig#sha1"/><ds:DigestValue>UNDWg8/olOcP0PmJvYUK9YBzH4Q=</ds:DigestValue></ds:Reference><ds:Reference URI="#PRV"><ds:Transforms><ds:Transform Algorithm="http://www.w3.org/2000/09/xmldsig#enveloped-signature"/><ds:Transform Algorithm="http://www.w3.org/2001/10/xml-exc-c14n#"/></ds:Transforms><ds:DigestMethod Algorithm="http://www.w3.org/2000/09/xmldsig#sha1"/><ds:DigestValue>sh1mM9ELocKYEdbMgjBDQiLwoAY=</ds:DigestValue></ds:Reference><ds:Reference URI="#BDY"><ds:Transforms><ds:Transform Algorithm="http://www.w3.org/2000/09/xmldsig#enveloped-signature"/><ds:Transform Algorithm="http://www.w3.org/2001/10/xml-exc-c14n#"/></ds:Transforms><ds:DigestMethod Algorithm="http://www.w3.org/2000/09/xmldsig#sha1"/><ds:DigestValue>c+8jf4yKL39/RrsNdO+n3hyVq34=</ds:DigestValue></ds:Reference></ds:SignedInfo><ds:SignatureValue>JU/2rbJreE+W7mfAr4x+hxgu8O8k72cd/CwA99lROPdDNl+YbLpiG5SmNuq264NyyBZv0ut85Sz1YXDolm+iLOQsNwQ2N5ZlIHnhrjCxijocrjpPA/0DaJJdQv9jhpoh/5h02jrmL8h/9KBpszwDrS04EAmyahsEY6/oWXMNeNA=</ds:SignatureValue></ds:Signature><wsu:Timestamp xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd" wsu:Id="TS"><wsu:Created>2011-01-25T11:24:47Z</wsu:Created></wsu:Timestamp></wsse:Security></e:Header><e:Body id="BDY"><rsp:Persoon_dboRootElement xmlns:rsp="http://www.risaris.com/namespaces/Persoon_dbo"><Persoon_dboRoot><Persoon_dboGroup><Voornamen>marcodeelnemer</Voornamen><Voorletters>M.</Voorletters><Tussenvoegsels/><Achternaam>Hartog_deel</Achternaam><Geslacht>M</Geslacht><Straat/><Huisnummer/><Postcode/><Plaats/><Land/><Telefoonnummer/><Faxnummer/><EmailAdres>lex.vander.meer@kenteq.nl</EmailAdres><Mobiel/><Geboortedatum/><Geboorteplaats/><Geboorteland/><Nationaliteit/><BurgerServiceNummer/><tas3_id>FdOvUkRiEHm4rdrOK9Kgna9F7</tas3_id></Persoon_dboGroup></Persoon_dboRoot></rsp:Persoon_dboRootElement></e:Body></e:Envelope>
Canon sha1 if <wsse:Security> verified OK 5

SIG Verified OK, zxid_sp_sso_finalize() returned 5
